# AutomaticLandingConvertedToSketchedLandingWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..AutomaticLandingConvertedToSketchedLandingWarning Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Some run(s) are deleted, so automatic landing is converted to sketched landing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AutomaticLandingConvertedToSketchedLandingWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AutomaticLandingConvertedToSketchedLandingWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AutomaticLandingConvertedToSketchedLandingWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace